app/controllers/api/v1/posts_controller.rb

SELECT `posts`.* FROM `posts`
---
  def index
    posts = Post.all

INSERT INTO `users` (`sub`, `created_at`, `updated_at`) VALUES ('td8rezjpH46qJ31O7ybAifB7ZAiChpM0@clients', '2022-11-19 21:11:42.036004', '2022-11-19 21:11:42.036004')
INSERT INTO `posts` (`user_id`, `title`, `caption`, `created_at`, `updated_at`) VALUES (1, 'タイトル１', '説明１', '2022-11-19 21:11:42.097133', '2022-11-19 21:11:42.097133')
---
  def create
    post = @current_user.posts.build(post_params)

    if post.save